---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
source: html/98de4607-2352-f27b-c4bb-316a0c3e00fd.htm
---
# StructuralSectionGeneralC Properties

Common set of parameters for structural analysis.